name: "preprocess_py"
backend: "python"
max_batch_size: 256
input [
{
    name: "raw_img_bytes"
    data_type: TYPE_UINT8
    dims: [ -1 ]
},
{
    name: "channel_mean"
    data_type: TYPE_FP32
    dims: [ 3 ]
},
{
    name: "channel_std"
    data_type: TYPE_FP32
    dims: [ 3 ]
}
]

output [
{
    name: "processed_img"
    data_type: TYPE_FP32
    dims: [1, 3, 1024, 2048 ]
}
]

instance_group [{ kind: KIND_CPU }]
